#language: ru
Функционал: Ozon.ru добавление в корзину нечетных товаров

  Сценарий: Фотоаппараты

    Когда Выбрали категорию меню -  "Электроника"
    Когда Выбрали подкатегорию -  "Зеркальные фотоаппараты"
    Тогда Выбрали бренд фотоаппаратов -  "Nikon"
    Тогда Выбрали бренд фотоаппаратов -  "Canon"
    Тогда Установили нижний предел цены -  "25000"
    Тогда Добавили все нечетные элементы в корзину
    Тогда Перешли в корзину
    Тогда Проверили что покупки добавились в корзину
    Тогда Удалили все из корзины
    Тогда Проверили что корзина пуста

  Сценарий: Телефоны

    Когда Выбрали категорию меню -  "Электроника"
    Когда Выбрали подкатегорию -  "Телефоны"
    Тогда Выбрали бренд телефонов -  "Apple"
    Тогда Установили нижний предел цены -  "20000"
    Тогда Добавили все нечетные элементы в корзину
    Тогда Перешли в корзину
    Тогда Проверили что покупки добавились в корзину
    Тогда Удалили все из корзины
    Тогда Проверили что корзина пуста